---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.Inverted3dShape
source: html/1053163b-b426-2147-ffd6-9c74618e369b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.Inverted3dShape Property

The Rebar Shape XX cannot be inverted.

## Syntax (C#)
```csharp
public static FailureDefinitionId Inverted3dShape { get; }
```